app/views/static_pages/_big_post.slim

        span.post-date
          = post.updated_at.strftime("%b %d, %Y")
---
UPDATE `posts` SET `active` = 1, `updated_at` = '2020-05-13 12:10:59' WHERE `posts`.`id` = 93