app/views/static_pages/_categories_list.slim

    = category.name
    span = category.posts.size
---
SELECT COUNT(*) FROM `posts` WHERE `posts`.`category_id` = 1