app/controllers/admin/categories_controller.rb

SELECT  `categories`.* FROM `categories` LIMIT 10 OFFSET 0
---
    def index
      @categories = Category.all.page(params[:page]).per(10)