app/controllers/admin/posts_controller.rb

    def load_post
      @post = Post.find params[:id]
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 101 LIMIT 1