app/controllers/admin/users_controller.rb

    def index
      @users = User.all.page(params[:page]).per(10)
---
SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`, `address`, `role`) VALUES ('admin@gmail.com', '$2a$11$MrtqfSo0SxA6Go0jrYegqOkGATN9OhPu2bOFTEpowRWKRGwx8JCja', '2020-05-13 15:34:10', '2020-05-13 15:34:10', 'admin', '', 2)

    def find_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1