app/controllers/author/posts_controller.rb

    def index
      @posts = Post.all.page(params[:page]).per(10)
---
SELECT  `posts`.* FROM `posts` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `posts`

    def update
      if @post.update_attributes post_params
---
UPDATE `posts` SET `user_id` = 1, `title` = 'Khái niệm Cortana và cách cài đặt trên máy tính', `header` = '(Techz.vn) Cortana là gì và cài đặt trên máy tính như thế nào? Bài viết dưới đây sẽ giải thích tất tần tật những thắc mắc này.\r\n', `content_new` = '<p>[&quot;Eum vel suscipit similique architecto ut inventore laboriosam.&quot;, &quot;Et debitis sunt sit dolore reiciendis repellat.&quot;, &quot;Accusantium aut possimus repellendus eaque et quia.&quot;, &quot;Veritatis rerum dolor sint ut quis repellendus perferendis.&quot;, &quot;Blanditiis corrupti accusamus rem quidem.&quot;]</p>\r\n', `updated_at` = '2020-05-17 14:16:29' WHERE `posts`.`id` = 1

    def load_post
      @post = Post.find params[:id]
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 101 LIMIT 1

    def load_categories
      @category_options = Category.pluck :name, :id
---
SELECT `categories`.`name`, `categories`.`id` FROM `categories`