app/views/author/posts/_post_form.slim

SELECT `categories`.`name`, `categories`.`id` FROM `categories`
---
          = f.label :category_id, "Category"
          = f.select :category_id, Category.pluck(:name, :id), {}, class: "form-control"