app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build comment_params
    @comment.save
    @comments = @post.comments.where(parent_id: nil)
---
INSERT INTO `comments` (`post_id`, `user_id`, `content`, `created_at`, `updated_at`, `parent_id`) VALUES (99, 1, 'No', '2020-05-13 15:37:36', '2020-05-13 15:37:36', 1)
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 99 AND `comments`.`parent_id` IS NULL

  def destroy
    @post = @comment.post
    @comment.destroy
    @comments = @post.comments.where(parent_id: nil)
---
DELETE FROM `comments` WHERE `comments`.`id` = 2
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 99 AND `comments`.`parent_id` IS NULL

  def load_post
    @post = Post.find_by id: params[:comment][:post_id]
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 2 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 99 LIMIT 1