app/controllers/posts_controller.rb

  def show
    @comments = @post.comments.where(parent_id: nil)
    @comment = @post.comments.build
    @tags = Tag.all.last(5)
---
SELECT  `tags`.* FROM `tags` ORDER BY `tags`.`id` DESC LIMIT 5

  def load_post
    (@post = Post.find_by_id(params[:id])) || not_found
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 100 LIMIT 1