app/controllers/reactions_controller.rb

INSERT INTO `reactions` (`action`, `user_id`, `reactionable_type`, `reactionable_id`, `created_at`, `updated_at`) VALUES (0, 1, 'Comment', 1, '2020-05-13 15:37:21', '2020-05-13 15:37:21')
---
  def create
    @reaction = @reactionable.reactions.build reaction_params.merge(user_id: current_user.id)
    @reaction.save

UPDATE `reactions` SET `action` = NULL, `updated_at` = '2020-05-13 15:37:41' WHERE `reactions`.`id` = 2
---
  def update
    @reaction = @reactionable.reactions.find_by(user_id: current_user.id)
    @reaction.update reaction_params