app/controllers/static_pages_controller.rb

  def index
    @recent_posts = Post.where(active: true).last(8)
    @categories_index = Category.all.includes(:posts).limit(4)
    @tags = Tag.all.last(5)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`active` = 1 ORDER BY `posts`.`id` DESC LIMIT 8
SELECT  `categories`.* FROM `categories` LIMIT 4
SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` IN (1, 2, 3, 4)
SELECT  `tags`.* FROM `tags` ORDER BY `tags`.`id` DESC LIMIT 5