app/controllers/tags_controller.rb

  def show
    @posts = Post.where(active: true).tagged_with(params[:id]).page(params[:page]).per(8)
    @recent_posts = Post.where(active: true).last(8)
    @categories_index = Category.all.includes(:posts).limit(4)
    @tags = Tag.all.last(5)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`active` = 1 ORDER BY `posts`.`id` DESC LIMIT 8
SELECT  `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC LIMIT 4
SELECT `categories`.* FROM `categories`
SELECT  `tags`.* FROM `tags` ORDER BY `tags`.`id` DESC LIMIT 5